nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_spi_gy912.c

/****************************************************************************
 * boards/arm/ra8/fpb-ra8e1/src/gy912_spi.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/
#ifdef CONFIG_RA8E1_SPI_GY912_EXAMPLE

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <debug.h>
#include <errno.h>
#include <string.h>
#include <assert.h>

#include <nuttx/spi/spi.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/semaphore.h>
#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "ra_gpio.h"
#include "board.h"
#include "ra8e1_log.h"

#ifdef CONFIG_RA_SPI

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* RA8E1 SPI Register Definitions */
#define RA8E1_SPI0_BASE         0x40072000
#define RA8E1_SPI_SPCR_OFFSET   0x00    /* SPI Control Register */
#define RA8E1_SPI_SSLP_OFFSET   0x01    /* SPI Slave Select Polarity Register */
#define RA8E1_SPI_SPPCR_OFFSET  0x02    /* SPI Pin Control Register */
#define RA8E1_SPI_SPSR_OFFSET   0x03    /* SPI Status Register */
#define RA8E1_SPI_SPDR_OFFSET   0x04    /* SPI Data Register */
#define RA8E1_SPI_SPSCR_OFFSET  0x08    /* SPI Sequence Control Register */
#define RA8E1_SPI_SPSSR_OFFSET  0x09    /* SPI Sequence Status Register */
#define RA8E1_SPI_SPBR_OFFSET   0x0A    /* SPI Bit Rate Register */
#define RA8E1_SPI_SPDCR_OFFSET  0x0B    /* SPI Data Control Register */
#define RA8E1_SPI_SPCKD_OFFSET  0x0C    /* SPI Clock Delay Register */
#define RA8E1_SPI_SSLND_OFFSET  0x0D    /* SPI Slave Select Negation Delay Register */
#define RA8E1_SPI_SPND_OFFSET   0x0E    /* SPI Next-Access Delay Register */
#define RA8E1_SPI_SPCR2_OFFSET  0x0F    /* SPI Control Register 2 */
#define RA8E1_SPI_SPCMD0_OFFSET 0x10    /* SPI Command Register 0 */

/* SPI Control Register (SPCR) bits */
#define RA8E1_SPI_SPCR_SPRIE    (1 << 7)  /* SPI Receive Interrupt Enable */
#define RA8E1_SPI_SPCR_SPE      (1 << 6)  /* SPI Function Enable */
#define RA8E1_SPI_SPCR_SPTIE    (1 << 5)  /* SPI Transmit Interrupt Enable */
#define RA8E1_SPI_SPCR_SPEIE    (1 << 4)  /* SPI Error Interrupt Enable */
#define RA8E1_SPI_SPCR_MSTR     (1 << 3)  /* SPI Master/Slave Mode Select */
#define RA8E1_SPI_SPCR_MODFEN   (1 << 2)  /* Mode Fault Error Detection Enable */
#define RA8E1_SPI_SPCR_TXMD     (1 << 1)  /* Communications Operating Mode Select */
#define RA8E1_SPI_SPCR_SPMS     (1 << 0)  /* SPI Mode Select */

/* SPI Status Register (SPSR) bits */
#define RA8E1_SPI_SPSR_SPRF     (1 << 7)  /* SPI Receive Buffer Full Flag */
#define RA8E1_SPI_SPSR_SPTEF    (1 << 5)  /* SPI Transmit Buffer Empty Flag */
#define RA8E1_SPI_SPSR_PERF     (1 << 3)  /* Parity Error Flag */
#define RA8E1_SPI_SPSR_MODF     (1 << 2)  /* Mode Fault Error Flag */
#define RA8E1_SPI_SPSR_IDLNF    (1 << 1)  /* SPI Idle Flag */
#define RA8E1_SPI_SPSR_OVRF     (1 << 0)  /* Overrun Error Flag */

/* SPI Command Register (SPCMD0) bits */
#define RA8E1_SPI_SPCMD_SCKDEN  (1 << 15) /* RSPCK Delay Setting Enable */
#define RA8E1_SPI_SPCMD_SLNDEN  (1 << 14) /* SSL Negation Delay Setting Enable */
#define RA8E1_SPI_SPCMD_SPNDEN  (1 << 13) /* SPI Next-Access Delay Enable */
#define RA8E1_SPI_SPCMD_LSBF    (1 << 12) /* SPI LSB First */
#define RA8E1_SPI_SPCMD_SPB_MASK (0x0F << 8) /* SPI Data Length Setting */
#define RA8E1_SPI_SPCMD_SPB_8   (0x07 << 8)  /* 8 bits */
#define RA8E1_SPI_SPCMD_SPB_16  (0x0F << 8)  /* 16 bits */
#define RA8E1_SPI_SPCMD_SSLKP   (1 << 7)  /* SSL Signal Level Keeping */
#define RA8E1_SPI_SPCMD_SSLA_MASK (0x07 << 4) /* SSL Signal Assertion Setting */
#define RA8E1_SPI_SPCMD_BRDV_MASK (0x03 << 2) /* Bit Rate Division Setting */
#define RA8E1_SPI_SPCMD_CPOL    (1 << 1)  /* RSPCK Polarity Setting */
#define RA8E1_SPI_SPCMD_CPHA    (1 << 0)  /* RSPCK Phase Setting */

/* DTC Register Definitions */
#define RA8E1_DTC_BASE          0x40005400
#define RA8E1_DTC_DTCCR_OFFSET  0x00    /* DTC Control Register */
#define RA8E1_DTC_DTCVBR_OFFSET 0x04    /* DTC Vector Base Register */
#define RA8E1_DTC_DTCADMOD_OFFSET 0x08  /* DTC Address Mode Register */
#define RA8E1_DTC_DTCST_OFFSET  0x0C    /* DTC Module Start Register */

/* DTC Transfer Information */
#define RA8E1_DTC_MRA_SM_MASK   (0x03 << 14) /* Source Address Mode */
#define RA8E1_DTC_MRA_SZ_MASK   (0x03 << 12) /* Data Transfer Size */
#define RA8E1_DTC_MRA_SZ_BYTE   (0x00 << 12) /* Byte */
#define RA8E1_DTC_MRA_SZ_WORD   (0x01 << 12) /* Word */
#define RA8E1_DTC_MRA_SZ_LONG   (0x02 << 12) /* Long word */
#define RA8E1_DTC_MRA_MD_MASK   (0x07 << 8)  /* DTC Transfer Mode */
#define RA8E1_DTC_MRA_MD_NORMAL (0x00 << 8)  /* Normal transfer mode */

/* Clock and Power Management */
#define RA8E1_MSTP_SPI0         (1 << 22)    /* SPI0 Module Stop */
#define RA8E1_MSTP_DTC          (1 << 28)    /* DTC Module Stop */

/* IRQ Numbers */
#define RA8E1_IRQ_SPI0_RXI      142
#define RA8E1_IRQ_SPI0_TXI      143
#define RA8E1_IRQ_SPI0_ERI      144

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* SPI Device Structure */
struct gy912_spidev_s
{
  struct spi_dev_s spidev;     /* Externally visible part of the SPI interface */
  uint32_t         spibase;    /* SPI controller register base address */
  uint32_t         frequency;  /* Requested clock frequency */
  uint32_t         actual;     /* Actual clock frequency */
  uint8_t          mode;       /* Mode 0,1,2,3 */
  uint8_t          nbits;      /* Width of word in bits (8 to 16) */
  bool             initialized; /* Has SPI been initialized? */
  sem_t            exclsem;    /* Mutual exclusion mutex */
  uint32_t         txword;     /* Next word to send */
  uint32_t         rxword;     /* Next word to receive */
  const void      *txbuffer;   /* Source buffer */
  void            *rxbuffer;   /* Sink buffer */
  size_t           ntxwords;   /* Size of TX buffer in words */
  size_t           nrxwords;   /* Size of RX buffer in words */
  size_t           nwords;     /* Number of words to be exchanged */
  volatile bool    dma_active; /* DMA transfer in progress */
  struct gy912_spi_transfer_s *current_xfer; /* Current transfer context */
};

/* DTC Transfer Information Structure */
struct ra8e1_dtc_info_s
{
  uint32_t mra;     /* Mode Register A */
  uint32_t mrb;     /* Mode Register B */
  uint32_t sar;     /* Source Address Register */
  uint32_t dar;     /* Destination Address Register */
  uint32_t cra;     /* Transfer Count Register A */
  uint32_t crb;     /* Transfer Count Register B */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* SPI methods */
static int      gy912_spi_lock(struct spi_dev_s *dev, bool lock);
static uint32_t gy912_spi_setfrequency(struct spi_dev_s *dev, uint32_t frequency);
static void     gy912_spi_setmode(struct spi_dev_s *dev, enum spi_mode_e mode);
static void     gy912_spi_setbits(struct spi_dev_s *dev, int nbits);
#ifdef CONFIG_SPI_HWFEATURES
static int      gy912_spi_hwfeatures(struct spi_dev_s *dev, spi_hwfeatures_t features);
#endif
static uint32_t gy912_spi_send(struct spi_dev_s *dev, uint32_t wd);
static void     gy912_spi_exchange(struct spi_dev_s *dev, const void *txbuffer,
                                   void *rxbuffer, size_t nwords);
#ifndef CONFIG_SPI_EXCHANGE
static void     gy912_spi_sndblock(struct spi_dev_s *dev, const void *txbuffer,
                                   size_t nwords);
static void     gy912_spi_recvblock(struct spi_dev_s *dev, void *rxbuffer,
                                    size_t nwords);
#endif

/* Initialization */
static void     gy912_spi_bus_initialize(struct gy912_spidev_s *priv);

/* DMA support */
static int      gy912_spi_dma_setup_transfer(struct gy912_spidev_s *priv,
                                              struct gy912_spi_transfer_s *xfer);
static void     gy912_spi_dma_callback(struct gy912_spidev_s *priv, int result);

