nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_spi_gy912.c
/* Register access helpers */
static inline uint8_t gy912_spi_getreg8(struct gy912_spidev_s *priv, uint8_t offset);
static inline void gy912_spi_putreg8(struct gy912_spidev_s *priv, uint8_t offset, uint8_t value);
static inline uint16_t gy912_spi_getreg16(struct gy912_spidev_s *priv, uint8_t offset);
static inline void gy912_spi_putreg16(struct gy912_spidev_s *priv, uint8_t offset, uint16_t value);
static inline uint32_t gy912_spi_getreg32(struct gy912_spidev_s *priv, uint8_t offset);
static inline void gy912_spi_putreg32(struct gy912_spidev_s *priv, uint8_t offset, uint32_t value);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* SPI0 driver operations */
static const struct spi_ops_s g_spi0ops =
{
  .lock              = gy912_spi_lock,
  .select            = ra_spi0_select,
  .setfrequency      = gy912_spi_setfrequency,
  .setmode           = gy912_spi_setmode,
  .setbits           = gy912_spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = gy912_spi_hwfeatures,
#endif
  .status            = ra_spi0_status,
  .cmddata           = ra_spi0_cmddata,
  .send              = gy912_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = gy912_spi_exchange,
#else
  .sndblock          = gy912_spi_sndblock,
  .recvblock         = gy912_spi_recvblock,
#endif
  .registercallback  = 0,
};

/* SPI0 device structure */
static struct gy912_spidev_s g_spi0dev =
{
  .spidev   = { &g_spi0ops },
  .spibase  = RA8E1_SPI0_BASE,
  .exclsem  = SEM_INITIALIZER(1),
};

/* DTC transfer information for SPI TX and RX */
static struct ra8e1_dtc_info_s g_spi_dtc_tx_info;
static struct ra8e1_dtc_info_s g_spi_dtc_rx_info;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: gy912_spi_getreg8, gy912_spi_putreg8, etc.
 *
 * Description:
 *   Register access helpers
 *
 ****************************************************************************/

static inline uint8_t gy912_spi_getreg8(struct gy912_spidev_s *priv, uint8_t offset)
{
  return getreg8(priv->spibase + offset);
}

static inline void gy912_spi_putreg8(struct gy912_spidev_s *priv, uint8_t offset, uint8_t value)
{
  putreg8(value, priv->spibase + offset);
}

static inline uint16_t gy912_spi_getreg16(struct gy912_spidev_s *priv, uint8_t offset)
{
  return getreg16(priv->spibase + offset);
}

static inline void gy912_spi_putreg16(struct gy912_spidev_s *priv, uint8_t offset, uint16_t value)
{
  putreg16(value, priv->spibase + offset);
}

static inline uint32_t gy912_spi_getreg32(struct gy912_spidev_s *priv, uint8_t offset)
{
  return getreg32(priv->spibase + offset);
}

static inline void gy912_spi_putreg32(struct gy912_spidev_s *priv, uint8_t offset, uint32_t value)
{
  putreg32(value, priv->spibase + offset);
}

/****************************************************************************
 * Name: gy912_spi_lock
 *
 * Description:
 *   On SPI buses where there are multiple devices, it will be necessary to
 *   lock SPI to have exclusive access to the buses for a sequence of
 *   transfers.  The bus should be locked before the chip is selected. After
 *   locking the SPI bus, the caller should then also call the setfrequency,
 *   setbits, and setmode methods to make sure that the SPI is properly
 *   configured for the device.  If the SPI bus is being shared, then it
 *   may have been left in an incompatible state.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   lock - true: Lock spi bus, false: unlock SPI bus
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static int gy912_spi_lock(struct spi_dev_s *dev, bool lock)
{
  struct gy912_spidev_s *priv = (struct gy912_spidev_s *)dev;
  int ret;

  if (lock)
    {
      ret = nxsem_wait_uninterruptible(&priv->exclsem);
    }
  else
    {
      ret = nxsem_post(&priv->exclsem);
    }

  return ret;
}

/****************************************************************************
 * Name: gy912_spi_setfrequency
 *
 * Description:
 *   Set the SPI frequency.
 *
 * Input Parameters:
 *   dev -       Device-specific state data
 *   frequency - The SPI frequency requested
 *
 * Returned Value:
 *   Returns the actual frequency selected
 *
 ****************************************************************************/

static uint32_t gy912_spi_setfrequency(struct spi_dev_s *dev, uint32_t frequency)
{
  struct gy912_spidev_s *priv = (struct gy912_spidev_s *)dev;
  uint32_t pclk;
  uint32_t divisor;
  uint8_t spbr;
  uint8_t brdv;

  /* Check if frequency is already configured */
  if (priv->frequency == frequency)
    {
      return priv->actual;
    }

  /* Get peripheral clock frequency (PCLKA for RA8E1) */
  pclk = BOARD_PCLKA_FREQUENCY;

  /* Calculate divisor: SPI_CLK = PCLK / (2 * (SPBR + 1) * 2^BRDV) */
  /* Find best BRDV and SPBR combination */
  for (brdv = 0; brdv < 4; brdv++)
    {
      divisor = (1 << (brdv + 1));
      spbr = (pclk / (frequency * divisor)) - 1;

      if (spbr <= 255)
        {
          break;
        }
    }

  /* Limit SPBR to valid range */
  if (spbr > 255)
    {
      spbr = 255;
    }

  /* Calculate actual frequency */
  priv->actual = pclk / ((spbr + 1) * (1 << (brdv + 1)));
  priv->frequency = frequency;

  /* Configure bit rate */
  gy912_spi_putreg8(priv, RA8E1_SPI_SPBR_OFFSET, spbr);

  /* Update command register with BRDV */
  uint16_t spcmd = gy912_spi_getreg16(priv, RA8E1_SPI_SPCMD0_OFFSET);
  spcmd &= ~RA8E1_SPI_SPCMD_BRDV_MASK;
  spcmd |= (brdv << 2) & RA8E1_SPI_SPCMD_BRDV_MASK;
  gy912_spi_putreg16(priv, RA8E1_SPI_SPCMD0_OFFSET, spcmd);

  spiinfo("Frequency %d->%d\n", frequency, priv->actual);
  return priv->actual;
}

/****************************************************************************
 * Name: gy912_spi_setmode
 *
 * Description:
 *   Set the SPI mode.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   mode - The SPI mode requested
 *
 * Returned Value:
 *   Returns the actual SPI mode selected
 *
 ****************************************************************************/

static void gy912_spi_setmode(struct spi_dev_s *dev, enum spi_mode_e mode)
{
  struct gy912_spidev_s *priv = (struct gy912_spidev_s *)dev;
  uint16_t spcmd;

  spiinfo("mode=%d\n", mode);

  /* Has the mode changed? */
  if (mode != priv->mode)
    {
      /* Configure CPOL and CPHA in SPCMD0 register */
      spcmd = gy912_spi_getreg16(priv, RA8E1_SPI_SPCMD0_OFFSET);
      spcmd &= ~(RA8E1_SPI_SPCMD_CPOL | RA8E1_SPI_SPCMD_CPHA);

      switch (mode)
        {
          case SPIDEV_MODE0: /* CPOL=0; CPHA=0 */
            break;

          case SPIDEV_MODE1: /* CPOL=0; CPHA=1 */
            spcmd |= RA8E1_SPI_SPCMD_CPHA;
            break;

          case SPIDEV_MODE2: /* CPOL=1; CPHA=0 */
            spcmd |= RA8E1_SPI_SPCMD_CPOL;
            break;

          case SPIDEV_MODE3: /* CPOL=1; CPHA=1 */
            spcmd |= (RA8E1_SPI_SPCMD_CPOL | RA8E1_SPI_SPCMD_CPHA);
            break;

          default:
            return;
        }

      gy912_spi_putreg16(priv, RA8E1_SPI_SPCMD0_OFFSET, spcmd);
      priv->mode = mode;
    }
}

/****************************************************************************
 * Name: gy912_spi_setbits
 *
 * Description:
 *   Set the number of bits per word.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *   nbits - The number of bits requested
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void gy912_spi_setbits(struct spi_dev_s *dev, int nbits)
{
  struct gy912_spidev_s *priv = (struct gy912_spidev_s *)dev;
  uint16_t spcmd;

  spiinfo("nbits=%d\n", nbits);

  /* Has the number of bits changed? */
  if (nbits != priv->nbits)
    {
      /* Configure data length in SPCMD0 register */
      spcmd = gy912_spi_getreg16(priv, RA8E1_SPI_SPCMD0_OFFSET);
      spcmd &= ~RA8E1_SPI_SPCMD_SPB_MASK;

      if (nbits <= 8)
        {
          spcmd |= RA8E1_SPI_SPCMD_SPB_8;
          priv->nbits = 8;
        }
      else if (nbits <= 16)
        {
          spcmd |= RA8E1_SPI_SPCMD_SPB_16;
          priv->nbits = 16;
        }
      else
        {
          spierr("ERROR: Unsupported nbits: %d\n", nbits);
          return;
        }

      gy912_spi_putreg16(priv, RA8E1_SPI_SPCMD0_OFFSET, spcmd);
    }
}

#ifdef CONFIG_SPI_HWFEATURES
/****************************************************************************
 * Name: gy912_spi_hwfeatures
 *
 * Description:
 *   Set hardware-specific feature flags.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   features - H/W feature flags
 *
 * Returned Value:
 *   Zero (OK) if the selected H/W features are enabled; A negated errno
 *   value if any H/W feature is not supportable.
 *
 ****************************************************************************/

static int gy912_spi_hwfeatures(struct spi_dev_s *dev, spi_hwfeatures_t features)
{
  /* Other H/W features are not supported */
  return (features == 0) ? OK : -ENOSYS;
}
#endif

/****************************************************************************
 * Name: gy912_spi_send
 *
 * Description:
 *   Exchange one word on SPI
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *   wd  - The word to send.  the size of the data is determined by the
 *         number of bits selected for the SPI interface.
 *
 * Returned Value:
 *   response
 *
 ****************************************************************************/

