nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_spi_gy912.c
  spiinfo("SPI0 initialized with DMA support\n");
}

/****************************************************************************
 * Name: ra_spi0_select, ra_spi0_status, and ra_spi0_cmddata
 *
 * Description:
 *   These external functions must be provided by board-specific logic.
 *   They are implementations of the select, status, and cmddata methods
 *   of the SPI interface defined by struct spi_ops_s (see include/nuttx/spi/spi.h).
 *   All other methods including ra_spibus_initialize()) are provided by
 *   common RA8 logic.
 *
 ****************************************************************************/

void ra_spi0_select(struct spi_dev_s *dev, uint32_t devid, bool selected)
{
  spiinfo("devid: %d CS: %s\n", (int)devid, selected ? "assert" : "de-assert");
  gy912_spi_cs_control(devid, selected);
}

uint8_t ra_spi0_status(struct spi_dev_s *dev, uint32_t devid)
{
  uint8_t status = 0;

  switch (devid)
    {
      case SPIDEV_IMU(0):
      case SPIDEV_BAROMETER(0):
        status |= SPI_STATUS_PRESENT;
        break;

      default:
        break;
    }

  return status;
}

#ifdef CONFIG_SPI_CMDDATA
int ra_spi0_cmddata(struct spi_dev_s *dev, uint32_t devid, bool cmd)
{
  /* SPI sensors typically don't use command/data distinction */
  return OK;
}
#endif

#endif /* CONFIG_RA_SPI */

#if CONFIG_SPI_GY912_SAMPLE

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define GY912_HELP \
  "Usage: gy912_test [OPTIONS]\n" \
  "\n" \
  "OPTIONS:\n" \
  "  -h, --help     Show this help message\n" \
  "  -s, --single   Perform single reading\n" \
  "  -r, --run      Run continuous demonstration\n" \
  "  -t, --test     Run self-test only\n" \
  "  -i, --init     Initialize sensors only\n" \
  "\n" \
  "Examples:\n" \
  "  gy912_test -s      # Single sensor reading\n" \
  "  gy912_test -r      # Run continuous demo\n" \
  "  gy912_test -t      # Run self-test\n"

/****************************************************************************
 * External Functions
 ****************************************************************************/

/* These functions should be declared in a header file, but for simplicity
 * we declare them here. In a real implementation, they would be in
 * include/nuttx/sensors/gy912.h or similar.
 */

extern int gy912_spi_initialize(void);
extern int gy912_run(void);
extern int gy912_single_read(void);
extern int gy912_self_test(void);

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: show_help
 *
 * Description:
 *   Show help message
 *
 ****************************************************************************/

static void show_help(void)
{
  printf(GY912_HELP);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: ra8e1_spi_gy912_init
 *
 * Description:
 *   Initialize the SPI GY-912 demo
 *
 ****************************************************************************/

int ra8e1_spi_gy912_init(void)
{
  /* Initialize GY-912 sensor module */
  return gy912_spi_initialize();
}

/****************************************************************************
 * Name: ra8e1_spi_gy912_main
 *
 * Description:
 *   GY-912 SPI demo main function
 *
 ****************************************************************************/

int ra8e1_spi_gy912_main(int argc, FAR char *argv[])
{
  int ret = OK;
  bool help = false;
  bool single = false;
  bool run = false;
  bool test = false;
  bool init_only = false;
  int i;

  printf("GY-912 10DOF Sensor Test Application\n");
  printf("====================================\n\n");

  /* Parse command line arguments */
  for (i = 1; i < argc; i++)
    {
      if (strcmp(argv[i], "-h") == 0 || strcmp(argv[i], "--help") == 0)
        {
          help = true;
        }
      else if (strcmp(argv[i], "-s") == 0 || strcmp(argv[i], "--single") == 0)
        {
          single = true;
        }
      else if (strcmp(argv[i], "-r") == 0 || strcmp(argv[i], "--run") == 0)
        {
          run = true;
        }
      else if (strcmp(argv[i], "-t") == 0 || strcmp(argv[i], "--test") == 0)
        {
          test = true;
        }
      else if (strcmp(argv[i], "-i") == 0 || strcmp(argv[i], "--init") == 0)
        {
          init_only = true;
        }
      else
        {
          printf("Unknown option: %s\n\n", argv[i]);
          show_help();
          return EXIT_FAILURE;
        }
    }

  if (help)
    {
      show_help();
      return EXIT_SUCCESS;
    }

  /* If no specific action requested, show help */
  if (!single && !run && !test && !init_only)
    {
      printf("No action specified. Available actions:\n\n");
      show_help();
      return EXIT_SUCCESS;
    }

  /* Initialize sensors */
  printf("Initializing GY-912 sensors...\n");
  ret = gy912_spi_initialize();
  if (ret < 0)
    {
      printf("ERROR: Failed to initialize GY-912 sensors: %d\n", ret);
      return EXIT_FAILURE;
    }

  printf("GY-912 sensors initialized successfully!\n\n");

  if (init_only)
    {
      printf("Initialization complete.\n");
      return EXIT_SUCCESS;
    }

  /* Perform requested action */
  if (test)
    {
      printf("Running self-test...\n");
      ret = gy912_self_test();
      if (ret < 0)
        {
          printf("ERROR: Self-test failed: %d\n", ret);
          return EXIT_FAILURE;
        }
      printf("Self-test completed successfully!\n\n");
    }

  if (single)
    {
      printf("Performing single sensor reading...\n");
      ret = gy912_single_read();
      if (ret < 0)
        {
          printf("ERROR: Single reading failed: %d\n", ret);
          return EXIT_FAILURE;
        }
      printf("Single reading completed!\n\n");
    }

