nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_spi_gy912.c
  if (run)
    {
      printf("Starting continuous demonstration...\n");
      printf("Press Ctrl+C to stop.\n\n");
      ret = gy912_run();
      if (ret < 0)
        {
          printf("ERROR: Demonstration failed: %d\n", ret);
          return EXIT_FAILURE;
        }
      printf("Demonstration completed!\n\n");
    }

  return EXIT_SUCCESS;
}

#endif /* CONFIG_SPI_GY912_SAMPLE */


/****************************************************************************
 * Name: ra8e1_spi_initialize
 *
 * Description:
 *   Initialize SPI buses for the FPB-RA8E1 board
 *   This function initializes both SPI0 and SPI1 for loopback demo
 *
 ****************************************************************************/

int ra8e1_spi_initialize(void)
{
#ifdef CONFIG_RA_SPI
  struct spi_dev_s *spi0;
  struct spi_dev_s *spi1;
  int ret;

  /* Initialize SPI0 (Master) */
  spi0 = ra_spibus_initialize(0);
  if (!spi0)
    {
      syslog(LOG_ERR, "ERROR: Failed to initialize SPI0 (Master)\n");
      return -ENODEV;
    }

  /* Register SPI0 device */
  spi_register(spi0, 0);
  syslog(LOG_INFO, "SPI0 (Master) initialized successfully\n");

#ifdef CONFIG_RA_SPI1
  /* Initialize SPI1 (Slave) */
  spi1 = ra_spibus_initialize(1);
  if (!spi1)
    {
      syslog(LOG_ERR, "ERROR: Failed to initialize SPI1 (Slave)\n");
      return -ENODEV;
    }

  /* Register SPI1 device */
  spi_register(spi1, 1);
  syslog(LOG_INFO, "SPI1 (Slave) initialized successfully\n");
#endif

#ifdef CONFIG_SPI_DRIVER
  /* Register SPI character drivers */
  ret = spi_register_driver("/dev/spi0", spi0);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: Failed to register SPI0 driver: %d\n", ret);
      return ret;
    }

#ifdef CONFIG_RA_SPI1
  ret = spi_register_driver("/dev/spi1", spi1);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: Failed to register SPI1 driver: %d\n", ret);
      return ret;
    }
#endif
#endif

  syslog(LOG_INFO, "All SPI interfaces initialized for loopback demo\n");

#endif /* CONFIG_RA_SPI */

  return 0;
}

/****************************************************************************
 * Name: ra_spi0select
 *
 * Description:
 *   Select or deselect the SPI device specified by 'devid' for SPI0
 *
 ****************************************************************************/

#ifdef CONFIG_RA_SPI
void ra_spi0select(FAR struct spi_dev_s *dev, uint32_t devid,
                     bool selected)
{
  spiinfo("SPI0 devid: %" PRIu32 " CS: %s\n",
          devid, selected ? "assert" : "de-assert");

  /* Handle device selection based on device ID */
  switch (devid)
    {
#ifdef CONFIG_RA_SPI_GY912
      case SPIDEV_GY912(0):
        /* Handle GY-912 sensor chip select on SPI0 */
        /* Implementation would go here based on hardware pinout */
        break;
#endif

#ifdef CONFIG_RA_SPI_LOOPBACK_EXAMPLE
      case SPIDEV_USER(0):
        /* Handle loopback demo device selection */
        /* For loopback demo, CS handling may be simplified */
        break;
#endif

      default:
        break;
    }
}

/****************************************************************************
 * Name: ra_spi1select
 *
 * Description:
 *   Select or deselect the SPI device specified by 'devid' for SPI1
 *
 ****************************************************************************/

#ifdef CONFIG_RA_SPI1
void ra_spi1select(FAR struct spi_dev_s *dev, uint32_t devid,
                     bool selected)
{
  spiinfo("SPI1 devid: %" PRIu32 " CS: %s\n",
          devid, selected ? "assert" : "de-assert");

  /* Handle device selection based on device ID */
  switch (devid)
    {
#ifdef CONFIG_RA_SPI_LOOPBACK_EXAMPLE
      case SPIDEV_USER(1):
        /* Handle loopback demo device selection for SPI1 */
        /* For loopback demo between SPI0 and SPI1 */
        break;
#endif

      default:
        break;
    }
}
#endif

/****************************************************************************
 * Name: ra_spi0status
 *
 * Description:
 *   Return status information associated with the SPI0 device.
 *
 ****************************************************************************/

uint8_t ra_spi0status(FAR struct spi_dev_s *dev, uint32_t devid)
{
  uint8_t status = 0;

  switch (devid)
    {
#ifdef CONFIG_RA_SPI_GY912
      case SPIDEV_GY912(0):
        /* Return status for GY-912 sensor */
        status = SPI_STATUS_PRESENT;
        break;
#endif

#ifdef CONFIG_RA_SPI_LOOPBACK_EXAMPLE
      case SPIDEV_USER(0):
        /* Return status for loopback demo */
        status = SPI_STATUS_PRESENT;
        break;
#endif

      default:
        break;
    }

  return status;
}

/****************************************************************************
 * Name: ra_spi1status
 *
 * Description:
 *   Return status information associated with the SPI1 device.
 *
 ****************************************************************************/

#ifdef CONFIG_RA_SPI1
uint8_t ra_spi1status(FAR struct spi_dev_s *dev, uint32_t devid)
{
  uint8_t status = 0;

  switch (devid)
    {
#ifdef CONFIG_RA_SPI_LOOPBACK_EXAMPLE
      case SPIDEV_USER(1):
        /* Return status for loopback demo */
        status = SPI_STATUS_PRESENT;
        break;
#endif

      default:
        break;
    }

  return status;
}
#endif

#endif /* CONFIG_RA8E1_SPI_GY912_EXAMPLE */
